export const MESSAGES = {
  askName: 'Привет! Как тебя зовут?',
  askEmail: 'Отлично! Теперь введи свой e-mail',
  notAuthorized: 'Вы не авторизованы',
  doneMissingId: 'Пожалуйста, укажи ID задания: /done <taskId>',
  stepDefault: 'Напиши /start чтобы зарегистрироваться',
  invalidName: 'Имя должно быть от 2 до 50 символов. Попробуй ещё раз:',
  invalidEmail: 'Введи корректный email',
  telegramNotFound: 'Не удалось определить пользователя Telegram',
  taskDoneNotFound: 'Задание не найдено или уже выполнено',
  help: `
    /start - регистрация/вход
    /progress - отчет по заданиям
    /help - описание команд`,
  doneSuccess: (id: string) => `Задание ${id} отмечено как выполненное ✅`,
  welcome: (name: string) => `✅ Спасибо, ${name}, данные сохранены!`,
  getProgressMessage: (stats: {
    all: number;
    done: number;
    doneToday: number;
    doneWeek: number;
    doneMonth: number;
  }) => `
📊 *Ваш прогресс*
Всего заданий: ${stats.all}
Выполнено: ${stats.done}
Сегодня: ${stats.doneToday}
На этой неделе: ${stats.doneWeek}
В этом месяце: ${stats.doneMonth}`,
};
